RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_dac_regs.h
/*
 * DIV_CFG (RW)
 *
 * step mode and buffer mode:
 *   defines how many clk_dac cycles to change data to analog, should configured to less than 1MHz data rate.
 * Direct mode and trigger mode:
 *   defines how many clk_dac cycles to accpet the input data, dac will not accept new written data or trigger data before the clock cycles passed. should configured to less than 1MHz.
 * Note:
 * For direct mode and trigger mode, this config is not supported in hpm63xx and hpm62xx families.
 */
#define DAC_CFG1_DIV_CFG_MASK (0xFFFFU)
#define DAC_CFG1_DIV_CFG_SHIFT (0U)
#define DAC_CFG1_DIV_CFG_SET(x) (((uint32_t)(x) << DAC_CFG1_DIV_CFG_SHIFT) & DAC_CFG1_DIV_CFG_MASK)
#define DAC_CFG1_DIV_CFG_GET(x) (((uint32_t)(x) & DAC_CFG1_DIV_CFG_MASK) >> DAC_CFG1_DIV_CFG_SHIFT)

/* Bitfield definition for register: CFG2 */
/*
 * DMA_RST1 (WO)
 *
 * set to reset dma read pointer to buf1_start_addr;
 * if set both dma_rst0&dma_rst1, will set to buf0_start_addr
 * user can set fifo_clr bit when use dma_rst*
 */
#define DAC_CFG2_DMA_RST1_MASK (0x80U)
#define DAC_CFG2_DMA_RST1_SHIFT (7U)
#define DAC_CFG2_DMA_RST1_SET(x) (((uint32_t)(x) << DAC_CFG2_DMA_RST1_SHIFT) & DAC_CFG2_DMA_RST1_MASK)
#define DAC_CFG2_DMA_RST1_GET(x) (((uint32_t)(x) & DAC_CFG2_DMA_RST1_MASK) >> DAC_CFG2_DMA_RST1_SHIFT)

/*
 * DMA_RST0 (WO)
 *
 * set to reset dma read pointer to buf0_start_addr
 */
#define DAC_CFG2_DMA_RST0_MASK (0x40U)
#define DAC_CFG2_DMA_RST0_SHIFT (6U)
#define DAC_CFG2_DMA_RST0_SET(x) (((uint32_t)(x) << DAC_CFG2_DMA_RST0_SHIFT) & DAC_CFG2_DMA_RST0_MASK)
#define DAC_CFG2_DMA_RST0_GET(x) (((uint32_t)(x) & DAC_CFG2_DMA_RST0_MASK) >> DAC_CFG2_DMA_RST0_SHIFT)

/*
 * FIFO_CLR (WO)
 *
 * set to clear FIFO content(set both read/write pointer to 0)
 */
#define DAC_CFG2_FIFO_CLR_MASK (0x20U)
#define DAC_CFG2_FIFO_CLR_SHIFT (5U)
#define DAC_CFG2_FIFO_CLR_SET(x) (((uint32_t)(x) << DAC_CFG2_FIFO_CLR_SHIFT) & DAC_CFG2_FIFO_CLR_MASK)
#define DAC_CFG2_FIFO_CLR_GET(x) (((uint32_t)(x) & DAC_CFG2_FIFO_CLR_MASK) >> DAC_CFG2_FIFO_CLR_SHIFT)

/*
 * BUF_SW_TRIG (RW)
 *
 * software trigger for buffer mode,
 * W1C in single mode.
 * RW in continual mode
 */
#define DAC_CFG2_BUF_SW_TRIG_MASK (0x10U)
#define DAC_CFG2_BUF_SW_TRIG_SHIFT (4U)
#define DAC_CFG2_BUF_SW_TRIG_SET(x) (((uint32_t)(x) << DAC_CFG2_BUF_SW_TRIG_SHIFT) & DAC_CFG2_BUF_SW_TRIG_MASK)
#define DAC_CFG2_BUF_SW_TRIG_GET(x) (((uint32_t)(x) & DAC_CFG2_BUF_SW_TRIG_MASK) >> DAC_CFG2_BUF_SW_TRIG_SHIFT)

/*
 * STEP_SW_TRIG3 (RW)
 *
 */
#define DAC_CFG2_STEP_SW_TRIG3_MASK (0x8U)
#define DAC_CFG2_STEP_SW_TRIG3_SHIFT (3U)
#define DAC_CFG2_STEP_SW_TRIG3_SET(x) (((uint32_t)(x) << DAC_CFG2_STEP_SW_TRIG3_SHIFT) & DAC_CFG2_STEP_SW_TRIG3_MASK)
#define DAC_CFG2_STEP_SW_TRIG3_GET(x) (((uint32_t)(x) & DAC_CFG2_STEP_SW_TRIG3_MASK) >> DAC_CFG2_STEP_SW_TRIG3_SHIFT)

/*
 * STEP_SW_TRIG2 (RW)
 *
 */
#define DAC_CFG2_STEP_SW_TRIG2_MASK (0x4U)
#define DAC_CFG2_STEP_SW_TRIG2_SHIFT (2U)
#define DAC_CFG2_STEP_SW_TRIG2_SET(x) (((uint32_t)(x) << DAC_CFG2_STEP_SW_TRIG2_SHIFT) & DAC_CFG2_STEP_SW_TRIG2_MASK)
#define DAC_CFG2_STEP_SW_TRIG2_GET(x) (((uint32_t)(x) & DAC_CFG2_STEP_SW_TRIG2_MASK) >> DAC_CFG2_STEP_SW_TRIG2_SHIFT)

/*
 * STEP_SW_TRIG1 (RW)
 *
 */
#define DAC_CFG2_STEP_SW_TRIG1_MASK (0x2U)
#define DAC_CFG2_STEP_SW_TRIG1_SHIFT (1U)
#define DAC_CFG2_STEP_SW_TRIG1_SET(x) (((uint32_t)(x) << DAC_CFG2_STEP_SW_TRIG1_SHIFT) & DAC_CFG2_STEP_SW_TRIG1_MASK)
#define DAC_CFG2_STEP_SW_TRIG1_GET(x) (((uint32_t)(x) & DAC_CFG2_STEP_SW_TRIG1_MASK) >> DAC_CFG2_STEP_SW_TRIG1_SHIFT)

/*
 * STEP_SW_TRIG0 (RW)
 *
 * software trigger0 for step mode,
 * W1C in single mode.
 * RW in continual mode
 */
#define DAC_CFG2_STEP_SW_TRIG0_MASK (0x1U)
#define DAC_CFG2_STEP_SW_TRIG0_SHIFT (0U)
#define DAC_CFG2_STEP_SW_TRIG0_SET(x) (((uint32_t)(x) << DAC_CFG2_STEP_SW_TRIG0_SHIFT) & DAC_CFG2_STEP_SW_TRIG0_MASK)
#define DAC_CFG2_STEP_SW_TRIG0_GET(x) (((uint32_t)(x) & DAC_CFG2_STEP_SW_TRIG0_MASK) >> DAC_CFG2_STEP_SW_TRIG0_SHIFT)

/* Bitfield definition for register array: STEP_CFG */
/*
 * ROUND_MODE (RW)
 *
 * 0: stop at end point;
 * 1: reload start point, step again
 */
#define DAC_STEP_CFG_ROUND_MODE_MASK (0x20000000UL)
#define DAC_STEP_CFG_ROUND_MODE_SHIFT (29U)
#define DAC_STEP_CFG_ROUND_MODE_SET(x) (((uint32_t)(x) << DAC_STEP_CFG_ROUND_MODE_SHIFT) & DAC_STEP_CFG_ROUND_MODE_MASK)
#define DAC_STEP_CFG_ROUND_MODE_GET(x) (((uint32_t)(x) & DAC_STEP_CFG_ROUND_MODE_MASK) >> DAC_STEP_CFG_ROUND_MODE_SHIFT)

/*
 * UP_DOWN (RW)
 *
 * 0 for up, 1 for down
 */
#define DAC_STEP_CFG_UP_DOWN_MASK (0x10000000UL)
#define DAC_STEP_CFG_UP_DOWN_SHIFT (28U)
#define DAC_STEP_CFG_UP_DOWN_SET(x) (((uint32_t)(x) << DAC_STEP_CFG_UP_DOWN_SHIFT) & DAC_STEP_CFG_UP_DOWN_MASK)
#define DAC_STEP_CFG_UP_DOWN_GET(x) (((uint32_t)(x) & DAC_STEP_CFG_UP_DOWN_MASK) >> DAC_STEP_CFG_UP_DOWN_SHIFT)

/*
 * END_POINT (RW)
 *
 */
#define DAC_STEP_CFG_END_POINT_MASK (0xFFF0000UL)
#define DAC_STEP_CFG_END_POINT_SHIFT (16U)
#define DAC_STEP_CFG_END_POINT_SET(x) (((uint32_t)(x) << DAC_STEP_CFG_END_POINT_SHIFT) & DAC_STEP_CFG_END_POINT_MASK)
#define DAC_STEP_CFG_END_POINT_GET(x) (((uint32_t)(x) & DAC_STEP_CFG_END_POINT_MASK) >> DAC_STEP_CFG_END_POINT_SHIFT)

/*
 * STEP_NUM (RW)
 *
 * output data change step_num each DAC clock cycle.
 * Ex: if step_num=3, output data sequence is 0,3,6,9
 * NOTE:  user should make sure end_point can be reached if step_num is not 1
 * if step_num is 0, output data will always at start point
 */
#define DAC_STEP_CFG_STEP_NUM_MASK (0xF000U)
#define DAC_STEP_CFG_STEP_NUM_SHIFT (12U)
#define DAC_STEP_CFG_STEP_NUM_SET(x) (((uint32_t)(x) << DAC_STEP_CFG_STEP_NUM_SHIFT) & DAC_STEP_CFG_STEP_NUM_MASK)
#define DAC_STEP_CFG_STEP_NUM_GET(x) (((uint32_t)(x) & DAC_STEP_CFG_STEP_NUM_MASK) >> DAC_STEP_CFG_STEP_NUM_SHIFT)

/*
 * START_POINT (RW)
 *
 */
#define DAC_STEP_CFG_START_POINT_MASK (0xFFFU)
#define DAC_STEP_CFG_START_POINT_SHIFT (0U)
#define DAC_STEP_CFG_START_POINT_SET(x) (((uint32_t)(x) << DAC_STEP_CFG_START_POINT_SHIFT) & DAC_STEP_CFG_START_POINT_MASK)
#define DAC_STEP_CFG_START_POINT_GET(x) (((uint32_t)(x) & DAC_STEP_CFG_START_POINT_MASK) >> DAC_STEP_CFG_START_POINT_SHIFT)

